app/views/main/index.html.erb

SELECT "schedule_days"."day_of_week" FROM "schedule_days" WHERE "schedule_days"."user_id" = 6
---
      Здравствуйте, <%= current_user.name %>, ваши дни:
      <% selected = current_user.schedule_days.pluck(:day_of_week) %>

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
---
    function updatePointsStrategy(lessons) {
        fetch('/main/calculate_strategy', {
            method: 'POST',
            headers: {
                'Content-Type': 'application/json',
                'X-CSRF-Token': document.querySelector('[name="csrf-token"]').getAttribute('content')
            },
            body: JSON.stringify({
                semester_goal_lessons: parseInt(lessons),
                target_points: document.querySelector('input[name="user[target_points]"]:checked')?.value || 60
            })
        })
            .then(response => response.json())
            .then(data => {
                // Обновляем правую панель
                document.querySelector('.current-points-value').textContent = data.current_points;

                const strategyDiv = document.querySelector('.current-points-display div[style*="margin-top: 20px"]');
                if (data.possible) {
                    strategyDiv.innerHTML = `
                Вы наберёте <b>${data.total_points}</b> баллов
                при выбранных днях, посетив <b>${data.attend_term1}</b> занятий в первом семестре и