app/services/points_strategy.rb

  def self.compute(user:, target_points:, target_range:, semester_goal_lessons: nil)
    # ✅ PRIORITY: params > DB > default
    lessons = semester_goal_lessons || user.semester_goal_lessons || 10
    weekdays = user.schedule_days.pluck(:day_of_week).map(&:to_sym)
---
SELECT "schedule_days"."day_of_week" FROM "schedule_days" WHERE "schedule_days"."user_id" = 6