app/views/settings/edit.html.erb

  <h3>Расписание</h3>
  <% selected = @user.schedule_days.pluck(:day_of_week) %>
---
SELECT "schedule_days"."day_of_week" FROM "schedule_days" WHERE "schedule_days"."user_id" = 2