app/controllers/main_controller.rb

SELECT "schedule_days"."day_of_week" FROM "schedule_days" WHERE "schedule_days"."user_id" = 6
---
  def index
    return unless current_user

    @selected_days = current_user.schedule_days.pluck(:day_of_week)