app/controllers/main_controller.rb

  def index
    @user = User.first  # For testing
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1