app/controllers/settings_controller.rb

  def update
    @user = current_user

    if @user.update(settings_params)
---
UPDATE "users" SET "target_points" = 71, "updated_at" = '2025-12-21 13:42:39.869780', "semester_goal_lessons" = 8 WHERE "users"."id" = 6

  def update_points
    @user = current_user
    delta = params[:delta].to_i
    current = @user.current_points || 0

    new_value = [[current + delta, 0].max, 100].min

    @user.update!(current_points: new_value)
---
UPDATE "users" SET "current_points" = 3, "updated_at" = '2025-12-21 13:42:21.214425' WHERE "users"."id" = 6

  def save_schedule_days!
    days = Array(params[:days])
    @user.schedule_days.delete_all
    days.each { |day| @user.schedule_days.create!(day_of_week: day) }
---
DELETE FROM "schedule_days" WHERE "schedule_days"."user_id" = 6
INSERT INTO "schedule_days" ("user_id", "day_of_week", "created_at", "updated_at") VALUES (6, 1, '2025-12-21 13:43:08.408470', '2025-12-21 13:43:08.408470') RETURNING "id"