app/controllers/users_controller.rb

INSERT INTO "users" ("name", "login", "password_digest", "target_points", "current_points", "created_at", "updated_at", "semester_goal_lessons") VALUES ('Михаил', 'Михаил', '$2a$12$YdvXYuL8Upcw0OI2BTyplui/J2YRaPlYsUbX9ByQVeQUEL6Afk7L.', 60, 0, '2025-12-21 13:31:47.854183', '2025-12-21 13:31:47.854183', 3) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save